### Pandas
pandas is a popular Python based data analysis toolkit.

In [1]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [3]:
ser = pd.Series()
ser
#print('{}\n'.format(ser))

Series([], dtype: float64)

In [5]:
ser = pd.Series([0,10,20,30,40,50,60,70,80,90])
ser

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
dtype: int64

In [6]:
# Notice Datatype
ser = pd.Series([45,15.5,'20'])
ser

0      45
1    15.5
2      20
dtype: object

In [7]:
type(ser)

pandas.core.series.Series

In [8]:
# Create Dictionary
dict = {'A':[1,2,6,], 'B':[2,4,9,],'C':[5,9,4]}
dict

{'A': [1, 2, 6], 'B': [2, 4, 9], 'C': [5, 9, 4]}

In [9]:
df = pd.DataFrame(dict)
df

   A  B  C
0  1  2  5
1  2  4  9
2  6  9  4

In [13]:
#Add a new column and add value into it
df['D']="One Two Ten".split()
df

   A  B  C    D
0  1  2  5  One
1  2  4  9  Two
2  6  9  4  Ten

In [14]:
df['E'] = [10,12,58]
df

   A  B  C    D   E
0  1  2  5  One  10
1  2  4  9  Two  12
2  6  9  4  Ten  58

In [4]:
# How to create NaN value and its manipulation
dict = {'A':[1,2,np.NaN], 'B':[2,np.NaN,np.NaN],'C':[5,9,4], 'D':[20,45,41]}
dict

{'A': [1, 2, nan], 'B': [2, nan, nan], 'C': [5, 9, 4], 'D': [20, 45, 41]}

In [5]:
df = pd.DataFrame(dict)
df

     A    B  C   D
0  1.0  2.0  5  20
1  2.0  NaN  9  45
2  NaN  NaN  4  41

In [6]:
print("dopping column with NaN values\n",'-'*35)
print(df.dropna(axis=1))

dopping column with NaN values
 -----------------------------------
   C   D
0  5  20
1  9  45
2  4  41

In [7]:
df

     A    B  C   D
0  1.0  2.0  5  20
1  2.0  NaN  9  45
2  NaN  NaN  4  41

In [8]:
# NaN valus is deleted temprerirly not permanent because we only print or show this time not save this value
# if we want to save it then we write like this - df = df.dropna(axis=0)
print("dopping any row with NaN values\n",'-'*35)
print(df.dropna(axis=0))

dopping any row with NaN values
 -----------------------------------
     A    B  C   D
0  1.0  2.0  5  20

In [9]:
df

     A    B  C   D
0  1.0  2.0  5  20
1  2.0  NaN  9  45
2  NaN  NaN  4  41

In [10]:
print("\n filling value with defalt value\n",'-'*35)
print(df.fillna(value=50))

 filling value with defalt value
 -----------------------------------
      A     B  C   D
0   1.0   2.0  5  20
1   2.0  50.0  9  45
2  50.0  50.0  4  41

In [11]:
# dataframe remain same will see how to save the dataframe
df

     A    B  C   D
0  1.0  2.0  5  20
1  2.0  NaN  9  45
2  NaN  NaN  4  41

In [12]:
df = df.fillna(value=50)

In [13]:
df

      A     B  C   D
0   1.0   2.0  5  20
1   2.0  50.0  9  45
2  50.0  50.0  4  41

In [14]:
# How to create NaN value and its manipulation
dict = {'A':[1,2,np.NaN], 'B':[2,np.NaN,np.NaN],'C':[5,9,4], 'D':[20,45,41]}
dict

{'A': [1, 2, nan], 'B': [2, nan, nan], 'C': [5, 9, 4], 'D': [20, 45, 41]}

In [15]:
df = pd.DataFrame(dict)
df

     A    B  C   D
0  1.0  2.0  5  20
1  2.0  NaN  9  45
2  NaN  NaN  4  41

In [16]:
# another way to save dave frame after filling value (in place of Nan)
print("\n Filling value with a computed value (Mean of column C here) \n", '-'*60)
df.fillna(value=df['C'].mean(), inplace = True)
print(df)

 Filling value with a computed value (Mean of column C here)
 ------------------------------------------------------------
     A    B  C   D
0  1.0  2.0  5  20
1  2.0  6.0  9  45
2  6.0  6.0  4  41

In [17]:
df

     A    B  C   D
0  1.0  2.0  5  20
1  2.0  6.0  9  45
2  6.0  6.0  4  41

In [2]:
# create dataframe
data1 = {'Company':['google','yahoo','google','FB','FB','yahoo'],
        'Person':['Vikas','Aarti','Avi','Bhuwnesh','Tabrez','Nupriya'],
        'Sales': [202,120,340,124,220,350],
        'Profit':[40,24,68,24,13,20]}

df=pd.DataFrame(data1)
df

  Company    Person  Sales  Profit
0  google     Vikas    202      40
1   yahoo     Aarti    120      24
2  google       Avi    340      68
3      FB  Bhuwnesh    124      24
4      FB    Tabrez    220      13
5   yahoo   Nupriya    350      20

 ## Groupby

In [5]:
# if we want to find the avg sales or profit of company then-
avg_sales =df.groupby('Company',as_index = False)['Sales'].mean()  # as_index = False  = To print index (it optional if u want)
print("\n Goupby Company column and listing mean sales\n",('-')*35)
print(avg_sales)

 Goupby Company column and listing mean sales
 -----------------------------------
  Company  Sales
0      FB  172.0
1  google  271.0
2   yahoo  235.0

In [9]:
df

  Company    Person  Sales  Profit
0  google     Vikas    202      40
1   yahoo     Aarti    120      24
2  google       Avi    340      68
3      FB  Bhuwnesh    124      24
4      FB    Tabrez    220      13
5   yahoo   Nupriya    350      20

In [4]:
total_sales = df.groupby('Company')[['Sales','Profit']].sum()
print("\n Goupby Company column and listing sum of sales anf profit\n",('-')*35)
print(total_sales)

 Goupby Company column and listing sum of sales anf profit
 -----------------------------------
         Sales  Profit
Company
FB         344      37
google     542     108
yahoo      470      44

In [5]:
df

  Company    Person  Sales  Profit
0  google     Vikas    202      40
1   yahoo     Aarti    120      24
2  google       Avi    340      68
3      FB  Bhuwnesh    124      24
4      FB    Tabrez    220      13
5   yahoo   Nupriya    350      20

In [6]:
sales_stats = df.groupby('Company')[['Sales','Profit']].agg(['mean','sum'])
print("\n Goupby Company column and both sum and Avg of sales and profit\n",('-')*35)
print(sales_stats)

 Goupby Company column and both sum and Avg of sales and profit
 -----------------------------------
         Sales      Profit
          mean  sum   mean  sum
Company
FB       172.0  344   18.5   37
google   271.0  542   54.0  108
yahoo    235.0  470   22.0   44

In [8]:
# Finding the largest value in each group. This produce sales and coresponding index
df.groupby('Company')['Sales'].nlargest(1)   # '1'  is top 1

Company
FB       4    220
google   2    340
yahoo    5    350
Name: Sales, dtype: int64

In [9]:
df

  Company    Person  Sales  Profit
0  google     Vikas    202      40
1   yahoo     Aarti    120      24
2  google       Avi    340      68
3      FB  Bhuwnesh    124      24
4      FB    Tabrez    220      13
5   yahoo   Nupriya    350      20

In [10]:
# Finding the smallest value in each group. This produce sales and coresponding index
df.groupby('Company')['Sales'].nsmallest(1)

Company
FB       3    124
google   0    202
yahoo    1    120
Name: Sales, dtype: int64

### Let's Learn about
-concat

-merge

-join

In [11]:
Class_A = pd.DataFrame({'math':[65,55,85,75],
                       'Eng':[55,60,71,63],
                       'Sci':[80,64,59,43],
                       'Chem':[55,70,65,60]},
                        index=['Raj','Amar','Riya','Shiba'])
Class_A

       math  Eng  Sci  Chem
Raj      65   55   80    55
Amar     55   60   64    70
Riya     85   71   59    65
Shiba    75   63   43    60

In [12]:
Class_B = pd.DataFrame({'math':[60,58,80,71],
                       'Eng':[60,55,69,55],
                       'Sci':[85,60,51,55],
                       'Chem':[54,68,60,75]},
                        index=['Rajesh','Akash','Ritesh','Suresh'])
Class_B

        math  Eng  Sci  Chem
Rajesh    60   60   85    54
Akash     58   55   60    68
Ritesh    80   69   51    60
Suresh    71   55   55    75

In [15]:
Class_C = pd.DataFrame({'math':[70,51,81,71],
                       'Eng':[59,69,58,68],
                       'Sci':[83,62,52,67],
                       'Chem':[59,72,61,65]},
                        index=['vikas','Aarti','Riyansh','Aarohi'])
Class_C

         math  Eng  Sci  Chem
vikas      70   59   83    59
Aarti      51   69   62    72
Riyansh    81   58   52    61
Aarohi     71   68   67    65

In [17]:
#Concatenation
All_Student_Marks =pd.concat([Class_A,Class_B,Class_C], axis=0)

print("\nAfter concatenation along Row\n",'-'*35)

All_Student_Marks

After concatenation along Row
 -----------------------------------

         math  Eng  Sci  Chem
Raj        65   55   80    55
Amar       55   60   64    70
Riya       85   71   59    65
Shiba      75   63   43    60
Rajesh     60   60   85    54
Akash      58   55   60    68
Ritesh     80   69   51    60
Suresh     71   55   55    75
vikas      70   59   83    59
Aarti      51   69   62    72
Riyansh    81   58   52    61
Aarohi     71   68   67    65

### Merge

In [19]:
Player_Id_Name = pd.DataFrame({
    'ID':[45,85,42,80,65,75,25],
    'Name':['Ronaldo','Messi','Virat','Ben','Afridi','Fleming','Jaisurya']
})
print("\n Player ID and Name \n ===================")
Player_Id_Name

 Player ID and Name
 ===================

   ID      Name
0  45   Ronaldo
1  85     Messi
2  42     Virat
3  80       Ben
4  65    Afridi
5  75   Fleming
6  25  Jaisurya

In [21]:
Player_Details = pd.DataFrame({
    'ID':[45,85,42,65,25],
    'Age':[30,35,40,45,38],
    'Country':['Portugal','Argentina','India','Pakistan','Srilanka']
})
print("\n ID Age and thier Country \n ===================")
Player_Details

 ID Age and thier Country
 ===================

   ID  Age    Country
0  45   30   Portugal
1  85   35  Argentina
2  42   40      India
3  65   45   Pakistan
4  25   38   Srilanka

In [23]:
Player_Id_Name

   ID      Name
0  45   Ronaldo
1  85     Messi
2  42     Virat
3  80       Ben
4  65    Afridi
5  75   Fleming
6  25  Jaisurya

In [25]:
print("====Details will be merge based on the matching ID")
Player_Full_Details=pd.merge(Player_Id_Name, Player_Details,on = 'ID')
Player_Full_Details

====Details will be merge based on the matching ID

   ID      Name  Age    Country
0  45   Ronaldo   30   Portugal
1  85     Messi   35  Argentina
2  42     Virat   40      India
3  65    Afridi   45   Pakistan
4  25  Jaisurya   38   Srilanka

### Join

In [8]:
#join operators
left = pd.DataFrame({'A': ['A0','A1','A2'],
                     'B': ['B0','B1','B2']},
                    index = ['K0','K1','K2'])

right = pd.DataFrame({'C': ['C0','C1','C2'],
                      'D': ['D0','D1','D2']},
                    index = ['K0','K2','K3'])

In [4]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [5]:
right

     C   D
K0  C0  D0
K2  C1  D1
K3  C2  D2

In [6]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [7]:
left.join(right, how ='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

### Apply Functions

In [12]:
df = pd.DataFrame({'Dept':[1,2,3,4,5],
                    'Emp_name':['vikas','Bhuwnesh','Aarti','Avi','Shourya'],
                    'Sal':[4526,6252,5482,6147,5845],
                    })
                        
df

   Dept  Emp_name   Sal
0     1     vikas  4526
1     2  Bhuwnesh  6252
2     3     Aarti  5482
3     4       Avi  6147
4     5   Shourya  5845

In [19]:
def sal_hike(x):
    if x > 4600:
        return np.ceil(x + (x * 0.3))
    else:
        return np.ceil(x * 1.5)

In [20]:
df['New_Sal'] = df['Sal'].apply(sal_hike)
df

   Dept  Emp_name   Sal  New_Sal
0     1     vikas  4526   6789.0
1     2  Bhuwnesh  6252   8128.0
2     3     Aarti  5482   7127.0
3     4       Avi  6147   7992.0
4     5   Shourya  5845   7599.0

In [22]:
df['Increased_Sal'] = df['New_Sal']-df['Sal']
df

   Dept  Emp_name   Sal  New_Sal  Increased_Sal
0     1     vikas  4526   6789.0         2263.0
1     2  Bhuwnesh  6252   8128.0         1876.0
2     3     Aarti  5482   7127.0         1645.0
3     4       Avi  6147   7992.0         1845.0
4     5   Shourya  5845   7599.0         1754.0

In [24]:
print("Sum of the column of New_Sal is - ", df['New_Sal'].sum())

Sum of the column of New_Sal is -  37635.0

In [28]:
print("Min Sal and  max Sal from Column New_Sal ", df['New_Sal'].min(),"and" ,df['New_Sal'].max())

Min Sal and  max Sal from Column New_Sal  6789.0 and 8128.0

In [32]:
print("\n Name of the columns\n",'-'*60)
print(df.columns)

 Name of the columns
 ------------------------------------------------------------
Index(['Dept', 'Emp_name', 'Sal', 'New_Sal', 'Increased_Sal'], dtype='object')

In [36]:
l = list(df.columns)
print("\n column names in a list of string for later manipulation\n\n",l)

 column names in a list of string for later manipulation

 ['Dept', 'Emp_name', 'Sal', 'New_Sal', 'Increased_Sal']

In [37]:
df

   Dept  Emp_name   Sal  New_Sal  Increased_Sal
0     1     vikas  4526   6789.0         2263.0
1     2  Bhuwnesh  6252   8128.0         1876.0
2     3     Aarti  5482   7127.0         1645.0
3     4       Avi  6147   7992.0         1845.0
4     5   Shourya  5845   7599.0         1754.0

In [40]:
print("\n Deleting Column\n")
df.drop('Sal',axis=1,inplace = True)

 Deleting Column

In [41]:
df

   Dept  Emp_name  New_Sal  Increased_Sal
0     1     vikas   6789.0         2263.0
1     2  Bhuwnesh   8128.0         1876.0
2     3     Aarti   7127.0         1645.0
3     4       Avi   7992.0         1845.0
4     5   Shourya   7599.0         1754.0

In [43]:
# you can also delete column by del command 
print("\n Delete column using by del command\n",'-'*40)
del df['Dept']
df

 Delete column using by del command
 ----------------------------------------

   Emp_name  New_Sal  Increased_Sal
0     vikas   6789.0         2263.0
1  Bhuwnesh   8128.0         1876.0
2     Aarti   7127.0         1645.0
3       Avi   7992.0         1845.0
4   Shourya   7599.0         1754.0

In [44]:
df.sort_values(by='New_Sal',ascending = False)

   Emp_name  New_Sal  Increased_Sal
1  Bhuwnesh   8128.0         1876.0
3       Avi   7992.0         1845.0
4   Shourya   7599.0         1754.0
2     Aarti   7127.0         1645.0
0     vikas   6789.0         2263.0

In [45]:
df.sort_values(by='New_Sal')

   Emp_name  New_Sal  Increased_Sal
0     vikas   6789.0         2263.0
2     Aarti   7127.0         1645.0
4   Shourya   7599.0         1754.0
3       Avi   7992.0         1845.0
1  Bhuwnesh   8128.0         1876.0